Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.ElementsAlreadyDisplacedInView
A Displacement Set can only be pasted into a 3D view in which none of its sub-elements is already a sub-element of another Displacement Set.

Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.DetectedCycleInDisplacedElementParents
Invalid parent relationship for a Displacement element. No cycles are allowed.

Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.CannotRemoveLastDisplacedElement
A Displacement Set can only be pasted into a view in the same document in which it was created.

Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.CannotCopyDisplacementSetIntoOtherDocument
A Displacement Set can only be pasted into a view in the same document in which it was created.

Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures
Error messages related to the DisplacementElement.